tap "olets/tap"
tap "yusukebe/tap"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Review-first terminal diff viewer for agent-authored changesets
brew "hunk"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Selects the right Node package manager based on lockfiles
brew "ni"
# Pins GitHub Actions to full hashes and versions
brew "pinact"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Text interface for Git repositories
brew "tig"
# Auto-expanding abbreviations manager for zsh, inspired by fish
brew "olets/tap/zsh-abbr", trusted: true
# The AI-era curl: fetch, discover, extract. One command.
brew "yusukebe/tap/ax", trusted: true
# Command-line interface for 1Password
cask "1password-cli"
# OpenAI's coding agent that runs in your terminal
cask "codex"
cask "font-hackgen-nerd"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source code editor
cask "visual-studio-code"
